* Definite Integrals

** Solution 1

$\int_0^3 (2x+1) \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = 2x + 1, a =
0, b = 3$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{3-0}{n} = \dfrac{3}{n}$

Next, the points that divided the interval $[0,3]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 0 + i \dfrac{3}{n} = \dfrac{3i}{n}$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = \dfrac{3i}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(\dfrac{3i}{n}) * \dfrac{3}{n}$

$= \sum_{i=1}^n ( \dfrac{6i}{n} + 1)* \dfrac{3}{n}$

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (6*i/n + 1) * (3/n)
soln = sum(f, i, 1, n)
soln.simplify_full()
#+end_src

#+RESULTS:
: 3*(4*n + 3)/n

#+begin_src sage :session nix
soln.expand()
#+end_src

#+RESULTS:
: 9/n + 12

Now we know that $R_n = \dfrac{9}{n} + 12$

$\int_0^3 (2x+1) \mathrm{d}x = \lim_{n \to \infty} R_n = \lim_{n \to \infty} \dfrac{9}{n} + 12 = 12$

** Solution 2

$\int_1^3 (2x+1) \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of he
quantities mentioned in Definition 5.3.1. We have $f(x) = 2x + 1, a =
1, b = 3$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{3-1}{n} = \dfrac{2}{n}$

Next, the points that divided the interval $[1,3]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 1 + i \dfrac{2}{n} = 1 + \dfrac{2i}{n}$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n-$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = 1 + \dfrac{2i}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(1 + \dfrac{2i}{n}) * \dfrac{2}{n}$

$= \sum_{i=1}^n ( 2 + \dfrac{4i}{n} + 1)* \dfrac{2}{n}$

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (2 + (4*i/n) + 1) * (2/n)
soln = sum(f, i, 1, n)
soln.expand()
#+end_src

#+RESULTS:
: 4/n + 10

Now we know that $R_n = \dfrac{4}{n} + 10$

$\int_0^3 (2x+1) \mathrm{d}x = \lim_{n \to \infty} R_n = \lim_{n \to \infty} \dfrac{4}{n} + 10 = 10$

We can also verify the above result using sagemath:

#+begin_src sage :session nix
integrate(2*x + 1, x, 1, 3)
#+end_src

#+RESULTS:
: 10

** Solution 3

$\int_0^4 x^2 \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = x^2, a =
0, b = 4$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{4-0}{n} = \dfrac{4}{n}$

Next, the points that divided the interval $[0,4]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 0 + i \dfrac{4}{n} = \dfrac{4i}{n}$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = \dfrac{4i}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(\dfrac{4i}{n}) * \dfrac{4}{n}$

$= \sum_{i=1}^n ( \dfrac{16i^2}{n^2})* \dfrac{4}{n}$

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (16 * i^2 / n^2) * (4/n)
soln = sum(f, i, 1, n)
soln.expand()
#+end_src

#+RESULTS:
: 32/n + 32/3/n^2 + 64/3

So, $R_n = 32/n + 32/3/n^2 + 64/3$

$\int_0^4 x^2 \mathrm{d}x = \lim_{n \to \infty} R_n = \dfrac{64}{3}$

** Solution 4

$\int_1^3 (4-x^2) \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = 4 - x^2, a =
1, b = 3$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{3-1}{n} = \dfrac{2}{n}$

Next, the points that divided the interval $[1,3]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 1 + i \dfrac{2}{n} = 1 + \dfrac{2i}{n}$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = 1 + \dfrac{2i}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(1 + \dfrac{2i}{n}) * \dfrac{2}{n}$

$= \sum_{i=1}^n ( 4 - (1 + \dfrac{2i}{n})^2)* \dfrac{2}{n}$

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (4 - (1 + (2*i/n))^2) * (2/n)
soln = sum(f, i, 1, n)
soln.expand()
#+end_src

#+RESULTS:
: -8/n - 4/3/n^2 - 2/3

So, $R_n = -8/n - 4/3/n^2 - 2/3$

$\int_1^3 (4-x^2) \mathrm{d}x = \lim_{n \to \infty} R_n = \dfrac{-2}{3}$

We can also verify the above result using sagemath:

#+begin_src sage :session nix
integrate(4-x^2, x, 1, 3)
#+end_src

#+RESULTS:
: -2/3

** Solution 5

$\int_{-1}^1 (x^2 - 3x + 1) \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = x^2 - 3x + 1, a =
-1, b = 1$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{1-(-1)}{n} = \dfrac{2}{n}$

Next, the points that divided the interval $[-1,1]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = -1 + i \dfrac{2}{n} = \dfrac{2i}{n} - 1$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = \dfrac{2i}{n} - 1$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(\dfrac{2i}{n} - 1) * \dfrac{2}{n}$

$= \sum_{i=1}^n ((2i/n - 1)^2 - (6i/n - 3) + 1)* \dfrac{2}{n}$

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (((2*i/n) - 1)^2 - ((6*i/n)-3) + 1)*(2/n)
soln = sum(f,i,1,n)
soln.expand()
#+end_src

#+RESULTS:
: -6/n + 4/3/n^2 + 8/3

So, $R_n = -6/n + 4/3/n^2 + 8/3$

$\int_{-1}^1 (x^2 - 3x + 1) \mathrm{d}x = \dfrac{8}{3}$

** Solution 6

$\int_1^4 x^3 \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = x^3, a =
1, b = 4$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{4-1}{n} = \dfrac{3}{n}$

Next, the points that divided the interval $[1,4]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 1 + i \dfrac{3}{n} = 1 + \dfrac{3i}{n}$

Finally, we must choose the sample points $x^{*}_i \in [x_{i-1},
x_i]$. According to theorem 5.3.2, it doesn't matter what choice we
make; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = 1 + \dfrac{3i}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(1 + \dfrac{3i}{n}) * \dfrac{3}{n}$

$= \sum_{i=1}^n ( (1 + 3i/n)^3)* \dfrac{3}{n}$

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (1 + (3*i/n))^3 * (3/n)
soln = sum(f, i, 1, n)
soln.expand()
#+end_src

#+RESULTS:
: 189/2/n + 135/4/n^2 + 255/4

Now we know that $R_n = 3/4*(85*n^2 + 126*n + 45)/n^2$

$\int_1^4 x^3 \mathrm{d}x = \lim_{n \to \infty} R_n = \lim_{n \to \infty} 189/2/n + 135/4/n^2 + 255/4 = 255/4$

We can also verify the above result using sagemath:

#+begin_src sage :session nix
integrate(x^3, x, 1, 4)
#+end_src

#+RESULTS:
: 255/4

** Solution 7

$\int_0^6 (2 - \dfrac{x}{2}) \mathrm{d}x$

Suppose $n$ is a positive integer. We begin by computing all of the
quantities mentioned in Definition 5.3.1. We have $f(x) = 2 - \dfrac{x}{2}, a =
0, b = 6$, so $\Delta x = \dfrac{(b-a)}{n}$

$= \dfrac{6-0}{n} = \dfrac{6}{n}$

Next, the points that divided the interval $[0,6]$ into $n$ smaller
intervals are given by the formula

$x_i = a + i \Delta x = 0 + i \dfrac{6}{n} = \dfrac{6i}{n}$

But we are asked to choose a different $x_i$

$x_i = x_{i-1} = \dfrac{6(i-1)}{n}$

According to theorem 5.3.2, it doesn't matter what choice we make for
$x_i$; all choices will lead to the same value when we take the limit
of the Riemann $n$ sum as $n \to \infty$.

Let $x_i^{*} = x_i = \dfrac{6(i-1)}{n}$

We can now work out a formula for the Riemann sum:

$R_n = \sum_{i=1}^n f(x_i^{*})\Delta x = \sum_{i=1}^n f(\dfrac{6(i-1)}{n}) * \dfrac{6}{n}$

$= \sum_{i=1}^n ( 2 - \dfrac{3(i-1)}{n} )* \dfrac{6}{n} $

Let's compute the result via SageMath:

#+begin_src sage :session nix
i,n = var('i n')
f = (2 - ((3*(i-1))/n)) * (6/n)
soln = sum(f, i, 1, n)
soln.expand()
#+end_src

#+RESULTS:
: 9/n + 3

Now we know that $R_n = \dfrac{9}{n} + 3$

$\int_0^6 (2 - \dfrac{x}{2}) \mathrm{d}x = \lim_{n \to \infty} R_n = \lim_{n \to \infty} \dfrac{9}{n} + 3 = 3$

** Solution 8

$\forall a,b,c \in R$

Suppose $a < b$

We have $\int_a^b c \mathrm{d}x$

Since $c$ is a constant, we know that $f(x) = 1$ which is a constant function. So,

$\int_a^b c f(x) \mathrm{d}x$

From theorem 5.3.6,

$c \int_a^b f(x) \mathrm{d}x$

Since the function is constant, we know that it's minimum and maximum
value are the same. So, From theorem 5.3.7,

$m(b-a) = \int_a^b f(x) \mathrm{d}x = M(b-a)$

Since $m = M = 1$,

$(b-a) = \int_a^b f(x) \mathrm{d}x = (b-a)$

Multiplying $c$ with it,

$c \int_a^b f(x) \mathrm{d}x = c(b-a)$

$\int_a^b cf(x) \mathrm{d}x = c(b-a)$

$\int_a^b c \mathrm{d}x = c(b-a)$

** Solution 9

Suppose $a>b$ and $f$ is continous on $[b,a]$ and let $m$ and $M$ be
the minimum and maximum values of $f$ on $[b,a]$.

We need to prove that $M(b-a) \leq \int_a^b f(x) \mathrm{d}x \leq m(b-a)$

For any positive integer $n$, let

$R_n = \sum_{i=1}^n f(x_i^{*}) \Delta x$

be a Riemann $n$ sum for $f$ where all notation is as in Definition
5.3.1. Since $M$ is the maximum value of $f$ on $[b,a]$, for every $i$
we have $f(x_i^{*}) \leq M$, and therefore

$R_n = \sum_{i=1}^n f(x_i^{*}) \Delta x \leq \sum_{i=1}^n M\delta x = M \delta x .n = M\dfrac{a-b}{n} = M(a-b)$

Taking the limit as $n \to \infty$ (and applying the preservation of
weak inequalities by limits), we conclude that

$\int_b^a f(x) \mathrm{d}x = \lim_{n \to \infty} R_n \leq M(a-b)$

$\int_b^a f(x) \mathrm{d}x \leq M(a-b)$

From Definition 5.3.10,

$- \int_a^b f(x) \mathrm{d}x \leq M(a-b)$

$\int_a^b f(x) \mathrm{d}x \geq M(b-a)$

$M(b-a) \leq \int_a^b f(x) \mathrm{d}x$

Similar reasoning establishes the other inequality in the theorem.

** Solution 10

I will just prove the first part of the theorem.

$\int_a^b c f(x) \mathrm{d}x = c \int_a^b f(x) \mathrm{d}x$

We already know from Theorem 5.3.6, that the above is true when $a <
b$. So, all we have to do is prove for $b > a$.

Suppose $b > a$

For any positive integer $n$, as usual we let $\Delta x =
\dfrac{b-a}{n}$ and $x_i = a + i\Delta x$ and we choose sample points
$x_i^{*} \in [x_{i-1}, x_i]$. Using these sample points, we get the
following Riemann summ for $f$ on $[a,b]$:

$R_n = \sum_{i=1}^n f(x_i^{*}) \Delta x$

We can also use these sample points to compute a Riemann sum for $f$:

$\sum_{i=1}^n f(x_i^{*}) \Delta x = R_n$

From the definition of definite integrals,

$\int_a^b f(x) \mathrm{d}x = \lim_{n \to \infty} R_n$

$c \int_a^b f(x) \mathrm{d}x = c\lim_{n \to \infty} R_n$

$c \int_a^b f(x) \mathrm{d}x = \lim_{n \to \infty} c R_n$

$c \int_a^b f(x) \mathrm{d}x = \int_a^b c f(x) \mathrm{d}x$
